ИИ_Агент/src/Enums/ИИА_СтатусDSL/ИИА_СтатусDSL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_СтатусDSL</name>
  <enumValues>
    <name>НеПрименяется</name>
  </enumValues>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>ОбработанУспешно</name>
  </enumValues>
  <enumValues>
    <name>ОбработанСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Исправляется</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/Enums/ИИА_ТипСообщения/ИИА_ТипСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_ТипСообщения</name>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/CommonModules/ИИА_Клиент/Module.bsl
#Область ПрограммныйИнтерфейс

// Находит или создает диалог текущего пользователя
//
// Возвращаемое значение:
//  СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Функция НайтиИлиСоздатьДиалогПользователя() Экспорт
	
	Возврат ИИА_ВызовСервера.НайтиИлиСоздатьДиалогПользователя(ТекущийПользователь());
	
КонецФункции

Функция ТекущийПользователь()
	Возврат "Админ";
КонецФункции

// Загружает сообщения диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Массив - массив структур с сообщениями
//
Функция ЗагрузитьСообщенияДиалога(СсылкаДиалога) Экспорт
	
	МассивСообщений = ИИА_ВызовСервера.ПолучитьСообщенияДиалога(СсылкаДиалога, 50);
	
	Возврат МассивСообщений;
	
КонецФункции

// Отправляет сообщение и получает ответ от ИИ
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТипСообщения - Строка - тип сообщения ("Чат" или "Запрос")
//  Текст - Строка - текст сообщения
//
// Возвращаемое значение:
//  Структура - структура ответа от сервера (содержит Usage и другую информацию)
//
Функция ОтправитьСообщение(СсылкаДиалога, ТипСообщения, Текст) Экспорт
	
	Результат = ИИА_ВызовСервера.ОтправитьСообщениеСервера(СсылкаДиалога, ТипСообщения, Текст);
	
	Возврат Результат;
	
КонецФункции

// Проверяет запрос 1С
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса
//
// Возвращаемое значение:
//  Структура - структура результата:
//   * Успех - Булево - успешность выполнения
//   * Сообщение - Строка - текст ошибки или пусто
//
Функция ПроверитьЗапрос(ТекстЗапроса) Экспорт
	
	Результат = ИИА_ВызовСервера.ПроверитьЗапрос(ТекстЗапроса);
	
	Возврат Результат;
	
КонецФункции

// Выполняет DSL-сценарий
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  DSLJSON - Строка - JSON с DSL командами
//
// Возвращаемое значение:
//  Структура - структура результата выполнения DSL
//
Функция ВыполнитьDSLСценарий(СсылкаДиалога, DSLJSON) Экспорт
	
	Результат = ИИА_ВызовСервера.ВыполнитьDSLСценарий(СсылкаДиалога, DSLJSON);
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает результат выполнения DSL и выполняет попытки исправления при ошибке
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  РезультатDSL - Структура - результат выполнения DSL
//  DSLJSON - Строка - исходный DSL-сценарий
//  ТекстПользователя - Строка - текст задачи пользователя
//  НомерПопытки - Число - номер текущей попытки (по умолчанию 0)
//  МаксимальноеКоличествоПопыток - Число - максимальное количество попыток (по умолчанию 5)
//
Процедура ОбработатьРезультатDSL(СсылкаДиалога, РезультатDSL, DSLJSON, ТекстПользователя = "", НомерПопытки = 0, МаксимальноеКоличествоПопыток = 5) Экспорт
	
	Если РезультатDSL.Успех Тогда
		// Успешное выполнение - ничего не делаем, сообщения уже добавлены на сервере
		Возврат;
	КонецЕсли;
	
	// Если ошибка и не достигнут лимит попыток, пытаемся исправить
	Если НомерПопытки < МаксимальноеКоличествоПопыток Тогда
		
		// Формируем промпт для исправления DSL (история ошибок уже будет в диалоге)
		ПромптИсправления = "Исправь следующий DSL-сценарий, который вызвал ошибку:" + Символы.ПС +
			"Текущая ошибка: " + РезультатDSL.Сообщение + Символы.ПС +
			"Исходный DSL-сценарий:" + Символы.ПС +
			DSLJSON + Символы.ПС +
			"Верни только исправленный JSON без дополнительных комментариев.";
		
		// Вызываем ИИ для исправления (история диалога с ошибками будет передана автоматически)
		ОтветИИ = ИИА_ВызовСервера.ИсправитьDSLЧерезИИ(СсылкаДиалога, ПромптИсправления);
		
		Если ОтветИИ <> Неопределено Тогда
			
			// Извлекаем DSL из ответа (может быть в поле DSL или Текст)
			ИсправленныйDSL = "";
			Если ОтветИИ.Свойство("DSL") И НЕ ПустаяСтрока(ОтветИИ.DSL) Тогда
				ИсправленныйDSL = ИИА_ВызовСервера.ИзвлечьDSLИзОтвета(ОтветИИ.DSL);
			КонецЕсли;
			Если ПустаяСтрока(ИсправленныйDSL) И ОтветИИ.Свойство("Текст") И НЕ ПустаяСтрока(ОтветИИ.Текст) Тогда
				ИсправленныйDSL = ИИА_ВызовСервера.ИзвлечьDSLИзОтвета(ОтветИИ.Текст);
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ИсправленныйDSL) Тогда
				
				// Обновляем статус на "Исправляется"
				ИИА_ВызовСервера.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, ПредопределенноеЗначение("Перечисление.ИИА_СтатусDSL.Исправляется"));
				
				// Добавляем сообщение о получении исправленного DSL
				ИИА_ВызовСервера.ДобавитьСистемноеСообщениеНаСервере(
					СсылкаДиалога,
					"Получен исправленный DSL-сценарий от ИИ (попытка " + Формат(НомерПопытки + 1, "ЧН=0") + "). Выполняю повторно...",
					ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Текст")
				);
				
				// Выполняем исправленный DSL-сценарий
				РезультатИсправленногоDSL = ИИА_ВызовСервера.ВыполнитьDSLСценарий(СсылкаДиалога, ИсправленныйDSL);
				
				// Рекурсивно обрабатываем результат
				ОбработатьРезультатDSL(СсылкаДиалога, РезультатИсправленногоDSL, ИсправленныйDSL, ТекстПользователя, НомерПопытки + 1, МаксимальноеКоличествоПопыток);
				
			Иначе
				// Не удалось извлечь DSL
				Если НомерПопытки + 1 < МаксимальноеКоличествоПопыток Тогда
					ОбработатьРезультатDSL(СсылкаДиалога, РезультатDSL, DSLJSON, ТекстПользователя, НомерПопытки + 1, МаксимальноеКоличествоПопыток);
				Иначе
					ИИА_ВызовСервера.ДобавитьСистемноеСообщениеНаСервере(
						СсылкаДиалога,
						"Не удалось извлечь исправленный DSL из ответа ИИ (попытка " + Формат(НомерПопытки + 1, "ЧН=0") + "). Достигнут лимит попыток исправления (" + Формат(МаксимальноеКоличествоПопыток, "ЧН=0") + ").",
						ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Ошибка")
					);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			// Не удалось получить ответ от ИИ
			Если НомерПопытки + 1 < МаксимальноеКоличествоПопыток Тогда
				ОбработатьРезультатDSL(СсылкаДиалога, РезультатDSL, DSLJSON, ТекстПользователя, НомерПопытки + 1, МаксимальноеКоличествоПопыток);
			Иначе
				ИИА_ВызовСервера.ДобавитьСистемноеСообщениеНаСервере(
					СсылкаДиалога,
					"Не удалось получить исправленный DSL от ИИ (попытка " + Формат(НомерПопытки + 1, "ЧН=0") + "). Достигнут лимит попыток исправления (" + Формат(МаксимальноеКоличествоПопыток, "ЧН=0") + ").",
					ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Ошибка")
				);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		// Достигнут лимит попыток
		ИИА_ВызовСервера.ДобавитьСистемноеСообщениеНаСервере(
			СсылкаДиалога,
			"Достигнут лимит попыток исправления (" + Формат(МаксимальноеКоличествоПопыток, "ЧН=0") + ").",
			ПредопределенноеЗначение("Перечисление.ИИА_ТипСообщения.Ошибка")
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
